// Реалізувати опитувач для користувача.
// Задати йому, за допомогою модальных окон (prompt/confirm), декілька запитань і оцінити відповіді.
// За кожну правильну відповідь нараховується 10 балів, за неправильну чи відмову від відповіді - 0.
// Після проходження всіх запитань вивести, за допомогою alert, результат.
// Запитання:
// 'Скільки буде 2+2?'
// 'Сонце встає на сході?'
// 'Скільки буде 5 / 0?'
// 'Якого кольору небо?'
// 'Яка правильна відповідь на головне питання життя, всесвіту та всього такого.' - відповідь 42

const questions = [
    {
        text: 'Скільки буде 2+2?',
        answer: '4'
    },
    {
        text: 'Сонце встає на сході?',
        answer: 'так'
    },
    {
        text: 'Скільки буде 5 / 0?',
        answer: 'нескінченність'
    },
    {
        text: 'Якого кольору небо?',
        answer: 'блакитний'
    },
    {
        text: 'Яка правильна відповідь на головне питання життя, всесвіту та всього такого.',
        answer: '42'
    },
]

let points = 0;

for (let question of questions) {
    const answer = prompt(question.text)?.trim()?.toLowerCase();
    if (answer === question.answer) points += 10;
}

alert(`You score is ${points}`);
